wiki.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-03-19 Mon 19:54 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Kownledge wiki</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="shuchaoma" />
<link rel="stylesheet" type="text/css" href="https://www.shuchaoma.com/css/stylesheet.css">
<link rel="shortcut icon" href="/css/favicon.ico">
</head>
<body>
<div id="content">
<h1 class="title">Kownledge wiki</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org00c21b9">1. <i>Networking</i></a></li>
<li><a href="#org33e48a7">2. <i>System</i></a></li>
<li><a href="#orgc5ac263">3. Language</a></li>
</ul>
</div>
</div>

<div id="outline-container-org00c21b9" class="outline-2">
<h2 id="org00c21b9"><span class="section-number-2">1</span> <i>Networking</i></h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li><a href="wiki/20170918-ping.html">ping</a> 作为世界上最常见的网络诊断工具，进行较系统的记录。</li>
<li><a href="./wiki/20170919-traceroute.html">traceroute</a> ping是第一常见的网络诊断工具的话，那traceroute就是第二。这款工具从上个世纪80年代末出现，现在依然具有顽强的生命力。这是一款路由探测工具。</li>
<li><a href="./wiki/20170926-traceroute-variant.html">traceroute变体</a> traceroute简单易用，多于简单的网络诊断是可以说“随身携带”，但是还有尚未随身携带的一些类似工具，其提供了更加强大的能力，比如LFT（layer four traceroute）、paris traceroute。</li>
</ul>
</div>
</div>


<div id="outline-container-org33e48a7" class="outline-2">
<h2 id="org33e48a7"><span class="section-number-2">2</span> <i>System</i></h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li><a href="./wiki/20171027-rsyslogd.html">syslog rsyslog syslog-ng</a></li>
<li><a href="./wiki/20180310-linux-command-tips.html">linux command tips</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgc5ac263" class="outline-2">
<h2 id="orgc5ac263"><span class="section-number-2">3</span> Language</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li><a href="./wiki/20171027-Python-Glossary.html">Python术语表（持续更新）</a></li>
<li><a href="./wiki/20171101-python-functional-programming.html">python函数式编程简述</a></li>
<li><a href="./wiki/20171104-python-errno-module.html">python errno模块</a></li>
<li><a href="./wiki/20171107-python-standard-library.html">python标准库索引</a></li>
<li><a href="./wiki/20171112-getopt-of-python-c-bash.html">命令行参数处理（c/bash/python）</a></li>
<li><a href="./wiki/20171119-python-class.html">python class综述</a></li>
</ul>
</div>
</div>
</div>
</body>
</html>
